## Week 2. Working with Object Collections

### Creating and Manipulating Lists of Objects

One way to create a list of objects is to follow the steps:
1. create an empty list
2. in a loop
2.1 create an object of the class
2.2 add the object to the list

In [1]:
#defining the Student class
class Student:
    def __init__(self,name,age,no_courses):
        self.name=name
        self.age=age
        self.no_courses=no_courses
    
    def __repr__(self):
        return "Hi! I'm student "+self.name+"! I am "+str(self.age)+" years old."
    
    def graduating(self):
        return self.no_courses==0
 #creating an empty list
student_list=[]

#adding 10 students to the list
for i in range(0,10):
    #creating random student name
    name="Student"+str(i)
    
    #creating random student age
    age= i*5 +10
    s=Student(name, age, i)
    #adding the student to the list
    student_list.append(s)

#printing the list content
print(student_list)

[Hi! I'm student Student0! I am 10 years old., Hi! I'm student Student1! I am 15 years old., Hi! I'm student Student2! I am 20 years old., Hi! I'm student Student3! I am 25 years old., Hi! I'm student Student4! I am 30 years old., Hi! I'm student Student5! I am 35 years old., Hi! I'm student Student6! I am 40 years old., Hi! I'm student Student7! I am 45 years old., Hi! I'm student Student8! I am 50 years old., Hi! I'm student Student9! I am 55 years old.]

Another way to add objects into a list is through list comprehension:

In [12]:
other_student_list=[Student("Student"+str(i),i*5 +10,i) for i in range(0,10)]
print(other_student_list)

[Hi! I'm student Student0! I am 10 years old., Hi! I'm student Student1! I am 15 years old., Hi! I'm student Student2! I am 20 years old., Hi! I'm student Student3! I am 25 years old., Hi! I'm student Student4! I am 30 years old., Hi! I'm student Student5! I am 35 years old., Hi! I'm student Student6! I am 40 years old., Hi! I'm student Student7! I am 45 years old., Hi! I'm student Student8! I am 50 years old., Hi! I'm student Student9! I am 55 years old.]

It is important to note that you can have objects of different classes as well as primitive types within the list. Let's consider another class, this time of a __Book__ with a title and author.

In [13]:
class Book:
    def __init__(self, title, author):
        self.title=title
        self.author=author

    def __repr__(self):
        return self.title+" by "+self.author
#let's add five books to the list
for i in range(0,10):
    #creating random book title and author
    title="Book"+str(i)
    
    author="Author"+str(i)
    
    b=Book(title,author)
    #adding the student to the list
    student_list.append(b)

print(student_list)

[Hi! I'm student Student0! I am 10 years old., Hi! I'm student Student1! I am 15 years old., Hi! I'm student Student2! I am 20 years old., Hi! I'm student Student3! I am 25 years old., Hi! I'm student Student4! I am 30 years old., Hi! I'm student Student5! I am 35 years old., Hi! I'm student Student6! I am 40 years old., Hi! I'm student Student7! I am 45 years old., Hi! I'm student Student8! I am 50 years old., Hi! I'm student Student9! I am 55 years old., Book0 by Author0, Book1 by Author1, Book2 by Author2, Book3 by Author3, Book4 by Author4, Book5 by Author5, Book6 by Author6, Book7 by Author7, Book8 by Author8, Book9 by Author9]

### Polymorphic behaviors of objects in lists

In [14]:
class PrimarySchoolStudent(Student):
    def __init__(self,name,age):
        Student.__init__(self,name,age,0)
        
    def graduating(self):
        return "Student is still in primary school. They have many years of study ahead of them."


#adding primary school students to other_student_list
for i in range(0,10):
    #creating new primary school student
    s=PrimarySchoolStudent("Student"+str(i+10),i)
    other_student_list.append(s)
    
#printing whether the student is graduating    
for student in other_student_list:
    print(student.graduating())

True
False
False
False
False
False
False
False
False
False
Student is still in primary school. They have many years of study ahead of them.
Student is still in primary school. They have many years of study ahead of them.
Student is still in primary school. They have many years of study ahead of them.
Student is still in primary school. They have many years of study ahead of them.
Student is still in primary school. They have many years of study ahead of them.
Student is still in primary school. They have many years of study ahead of them.
Student is still in primary school. They have many years of study ahead of them.
Student is still in primary school. They have many years of study ahead of them.
Student is still in primary school. They have many years of study ahead of them.
Student is still in primary school. They have many years of study ahead of them.

### Practice: Creating Lists of Objects

### Solution

In [12]:
#defining the person class
class Person:
    def __init__(self,name,age):
        self.name=name
        self.age=age
    
    def eats(self):
        print("Person is eating!")
        
    def sleeps(self):
        print("Person is sleeping!")
        
#defining the Employee class, inheriting from Person
class Employee(Person):
    def __init__(self,name,age,no_years):
        Person.__init__(self,name,age)
        self.no_years=no_years
        
    def go_to_work(self):
        print("I have been working for "+str(self.no_years)+" years, with many to come!")
    

#defining the Retiree class
class Retiree(Person):
    def __init__(self,name,age):
        Person.__init__(self,name,age)
        
        
    def relax(self):
        print("It is so good to relax!")

people_list=[]

#adding persons to the people_list. Note the parameter on the range function. Why do you think it is like that?
for i in range(50,65,3):
    p=Person("Person"+str(i), i)
    e=Employee("Person"+str(i),i,(i-30))
    r=Retiree("Person"+str(i), i)
    people_list.append(p)
    people_list.append(e)
    people_list.append(r)

for p in people_list:
    #we can do this for all objects p because they are all of type Person
    p.eats()
    p.sleeps()
    if isinstance(p,Employee):
        p.go_to_work()
    if isinstance(p,Retiree):
       p.relax()

Person is eating!
Person is sleeping!
Person is eating!
Person is sleeping!
I have been working for 20 years, with many to come!
Person is eating!
Person is sleeping!
It is so good to relax!
Person is eating!
Person is sleeping!
Person is eating!
Person is sleeping!
I have been working for 23 years, with many to come!
Person is eating!
Person is sleeping!
It is so good to relax!
Person is eating!
Person is sleeping!
Person is eating!
Person is sleeping!
I have been working for 26 years, with many to come!
Person is eating!
Person is sleeping!
It is so good to relax!
Person is eating!
Person is sleeping!
Person is eating!
Person is sleeping!
I have been working for 29 years, with many to come!
Person is eating!
Person is sleeping!
It is so good to relax!
Person is eating!
Person is sleeping!
Person is eating!
Person is sleeping!
I have been working for 32 years, with many to come!
Person is eating!
Person is sleeping!
It is so good to relax!

### Using Object Collections

In [9]:
#defining the Student class
class Student:
    def __init__(self,name,age):
        self.name=name
        self.age=age
    
    def __repr__(self):
        return str(self.age)
    
    def __lt__(self,other):
        return self.age<other.age
    
    def __eq__(self,other):
        return self.age==other.age
    

 
#creating an empty list
student_list=[]

#adding 10 students to the list
for i in range(10,0,-1):
    #creating random student name
    name="Student"+str(i)
    
    #creating random student age
    age= i*5 +10
    s=Student(name, age)
    #adding the student to the list
    student_list.append(s)

#printing the list content
print(student_list)

[60, 55, 50, 45, 40, 35, 30, 25, 20, 15]

#### Sorting using comparison operators

In [10]:
student_list.sort()
print(student_list)

[15, 20, 25, 30, 35, 40, 45, 50, 55, 60]

#### Sorting using the sort(lambda) function

A simpler and faster way of sorting when you want to use simple operators is to use the sort(lambda) function like this:

In [18]:
#reversing the student list such that it's unsorted again
new_list=student_list[::-1]
print(new_list)

#sorting it using the lambda key
new_list.sort(key = lambda s: s.age)
print(new_list)

[60, 55, 50, 45, 40, 35, 30, 25, 20, 15]
[15, 20, 25, 30, 35, 40, 45, 50, 55, 60]

### Practice 
Define a class called **Employee** where for each employee you define a salary and an age. Add five Employees to a list and then sort the list based on the **Employees** salary **and** age together.

### Solution

The simplest method to sort both based on the salary and age is to include the product in the operator functions, like this.

In [13]:
#defining the Student class
class Employee:
    def __init__(self,name,age,salary):
        self.name=name
        self.age=age
        self.salary=salary
    
    def __repr__(self):
        return str(self.age)+"..."+str(self.salary)+"\n"
    
    def __lt__(self,other):
        return self.age*self.salary<other.age*other.salary
    
    def __eq__(self,other):
        return self.age*self.salary==other.age*other.salary
    

 
#creating an empty list
employee_list=[]

#adding 5 employees to the list
for i in range(0,5):
    #creating random student name
    name="Employee"+str(i)
    
    #creating random employee age
    age= i*5 +10
    
    #create random salary
    salary=(i+1)*1000
    e=Employee(name, age,salary)
    
    #adding the employee to the list
    employee_list.append(e)

#printing the list content
print(employee_list)
new_list=employee_list[::-1]
print(new_list)

new_list.sort()

print(new_list)

[10...1000
, 15...2000
, 20...3000
, 25...4000
, 30...5000
]
[30...5000
, 25...4000
, 20...3000
, 15...2000
, 10...1000
]
[10...1000
, 15...2000
, 20...3000
, 25...4000
, 30...5000
]

## High-performance pandas operations

In [20]:
#import libraries
import numpy as np 
import pandas as pd

### Basic Operations in Pandas

One of the dataset that we will use during this section is "Silicon Valley Diversity Data", which is an open dataset that was  inspired by discussion of the distribution of the  workforce in Silicon Valley in favor of white people and males. You can find more information about the dataset by clicking on  https://www.kaggle.com/rtatman/silicon-valley-diversity-data/version/1

NOTE: If you're using a Jupyter notebook make sure that your dataset is in the same directory.

In [21]:
#Loading the dataset, creating a DataFrame and show the first five rows 
df_data = pd.DataFrame(pd.read_csv("Reveal_EEO1_for_2016.csv"))
df_data.head()

   company  year    race gender                       job_category count
0  23andMe  2016  Latino   male  Executive/Senior officials & Mgrs     0
1  23andMe  2016  Latino   male         First/Mid officials & Mgrs     1
2  23andMe  2016  Latino   male                      Professionals     7
3  23andMe  2016  Latino   male                        Technicians     0
4  23andMe  2016  Latino   male                      Sales workers     0

In [22]:
print ('The name of the columns are: ')
print(df_data.columns)
df_data.rename(columns={'count':'counting'}, inplace=True)
print('After applying the rename() function')
print(df_data.columns)

The name of the columns are:
Index(['company', 'year', 'race', 'gender', 'job_category', 'count'], dtype='object')
After applying the rename() function
Index(['company', 'year', 'race', 'gender', 'job_category', 'counting'], dtype='object')

In [23]:
#Shape and size 
print("Shape \n",df_data.shape,"\nSize\n",df_data.size)

Shape
 (3960, 6)
Size
 23760

In [24]:
#We want to know the statistics of the numeric data   
df_data.describe()

         year
count  3960.0
mean   2016.0
std       0.0
min    2016.0
25%    2016.0
50%    2016.0
75%    2016.0
max    2016.0

Why do you think this function only showed you the statistics for the "year" column, what happened with the "counting" column?

The answer is that the "counting" column is not a number. You can use **dtypes** to find the types of the columns.

In [25]:
#Getting the types by each column 
df_data.dtypes

company         object
year             int64
race            object
gender          object
job_category    object
counting        object
dtype: object

### Transforming your data

We need to transform the values of the columns that are objects that you consider should be numbers, i.e., 'counting' column, using the   astype() function to transform it to an integer.

In [26]:
df_data['counting'] = df_data.counting.astype('int64')

ValueError: invalid literal for int() with base 10: 'na'

**NOTE**: When you code has an error, you can find the main issue at the end of the error.

In [27]:
#To get how many rows with na value 
#NOTE: The name of the 
df_data['counting'][df_data.counting=='na'].count()

60

We got this error because we have 60 rows with 'na' value, which is not a value accepted for the **astype** function.

If this happens with your data, you can use the following method. 

1. Transform the desired values to 'NaN' 
2. Use the to_numeric function

Let's introduce a new function, called **loc**, which is used to select by index using a condition. In our case, we are using it to select rows with a value equals to 'na' in the 'counting' column and change them to NaN, so we can transform the type of the column to integer.

In [28]:
df_data.loc[df_data.counting=='na','counting']='NaN'

In [29]:
df_data['counting'][df_data.counting=='na'].count()

0

We can the use another function in Pandas called **to_numeric**.      
pd.to_numeric($<$DataFrame$>$['$<$columnName$>$'], error='coerce') 
this function can manage three type of errors: 
* coerce, the invalid parsing will be set as NaN
* ignore, the invalid parsing will return the input 
* raise, the invalid parsing will raise an exception 

More details about pandas to_numeric can be found at 
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_numeric.html

In [30]:
#Convert in numeric this column 
df_data['counting'] = pd.to_numeric(df_data['counting'],errors='coerce')
#After all is changed as a object 
print(df_data.dtypes)

company          object
year              int64
race             object
gender           object
job_category     object
counting        float64
dtype: object

In [31]:
#We review data to make sure that the changes are well done. 
#If you set a number as a parameter in head, indicate how many rows will display 
#In this case, only the first row is displayed. 
df_data.head(1)

   company  year    race gender                       job_category  counting
0  23andMe  2016  Latino   male  Executive/Senior officials & Mgrs       0.0

One interesting fact that we can also find in the data is the race that is most employed in  Silicon Valley.
First we get a look what race is found in the dataset, using **unique()**.

In [32]:
#Get the unique values per 'race' column
df_data.race.unique()

array(['Latino', 'White', 'Black_or_African_American',
       'Native_Hawaiian_or_Pacific_Islander', 'Asian',
       'American_Indian_Alaskan_Native', 'Two_or_more_races',
       'Overall_totals'], dtype=object)

We can see what the races are, but we cannot see the race that is most represented. 

### Grouping the Data

We introduce  two new functions, namely, **groupby()**, which is used to split the data into groups, and **sum()**, wich is an agregation function use to sum all the items.

In [33]:
df_data.groupby('race')['counting'].sum().sort_values(ascending=False)

race
Overall_totals                         1045284.0
White                                   617157.0
Asian                                   276530.0
Latino                                   75442.0
Black_or_African_American                52813.0
Two_or_more_races                        16647.0
American_Indian_Alaskan_Native            3530.0
Native_Hawaiian_or_Pacific_Islander       3165.0
Name: counting, dtype: float64

The most employed race is Overall_Totals. This comes from the fact that some companies do not disclose the race of their employees. For those that do, we see the breakdown under the Overall_Totals.

### Practice -

In [34]:
#Solution 
print('genders= ',df_data.gender.unique())
r,c=df_data.shape #To get how many rows and columns the data have  
print('Total of rows = ',r)
print(df_data.gender.value_counts())
print('Rows that have gender = ',df_data.gender.value_counts().sum())
print('NaNs=',r-df_data.gender.value_counts().sum())
print('Another way to get NaNs =',df_data.gender.isna().sum())
df_data.loc[df_data.gender.isna()==True,'gender']='gender_not_provided'
print('After change NaNs by no_gender')
print(df_data.gender.value_counts())
print(df_data.groupby('gender')['counting'].sum().sort_values(ascending=False))
print('The answer to our question is no_gender')

genders=  ['male' 'female' nan]
Total of rows =  3960
female    1848
male      1848
Name: gender, dtype: int64
Rows that have gender =  3696
NaNs= 264
Another way to get NaNs = 264
After change NaNs by no_gender
female                 1848
male                   1848
gender_not_provided     264
Name: gender, dtype: int64
gender
gender_not_provided    1045284.0
male                    729920.0
female                  315364.0
Name: counting, dtype: float64
The answer to our question is no_gender

## Combining Datasets

Merge and join are functions that take advantages of the high-performance memory manipulation in Pandas to combine the data. 

Concatenation in Pandas means that  rows or items are added to the end of an existing Series or DataFrame. Also, to avoid heavy lifting of performing concatenation operations, it is possible perform union and intersection operations.  

Merge, join and concatenation are based on **relational algebra**, quickly discussed below.

### Projection example 

In Pandas, projection can be performed with the iloc[] and loc [] methods. 

.iloc[] takes the integer positions of the axis (rows and columns) from 0 to the axis length-1. This works similar to slicing  two-dimensional arrays in NumPy: start, stop and step points. Only the start point is compulsory.  

$<DataFrame\_name>.iloc[start: stop: step]$


.loc[] is label-based, but you can also insert a condition, so it can work as a boolean, filtering the rows that satisfy that condition. 

$<DataFrame\_name>.iloc[<condition>, {<columns to project>}]$
 
**Warning**: Note that contrary to the common slicing in NumPy, both the start and the stop point are included.

In [35]:
#import libraries
import numpy as np 
import pandas as pd 

#Projection and restriction 
#load the data
Employee = pd.DataFrame(pd.read_csv('Employee.csv'))
Employee

          name                  position good_guy    Salary
0          Neo              Protagonist       Yes  2,000.00
1      Trinity        Underground hacker      Yes  1,700.00
2     Morpheus                    Leader      Yes  1,900.00
3     Sentinel      Robot to kill humans       No  1,100.00
4  Agent Smith          Neo's antagonist       No  1,800.00
5       Oracle  Guide of the freed minds      Yes  1,500.00

In [36]:
#Examples using iloc 
print(Employee.iloc[0])
#We project all the rows and only 0 and 1 column 
#Selecting rows and columns simultaneously
Employee.iloc[:,0:2]

name                 Neo
position    Protagonist
good_guy             Yes
Salary          2,000.00
Name: 0, dtype: object

          name                  position
0          Neo              Protagonist
1      Trinity        Underground hacker
2     Morpheus                    Leader
3     Sentinel      Robot to kill humans
4  Agent Smith          Neo's antagonist
5       Oracle  Guide of the freed minds

In [37]:
#Projection with restriccion using loc
#Selecting rows and columns simultaneously
Employee.loc[:,'name':'position']

          name                  position
0          Neo              Protagonist
1      Trinity        Underground hacker
2     Morpheus                    Leader
3     Sentinel      Robot to kill humans
4  Agent Smith          Neo's antagonist
5       Oracle  Guide of the freed minds

In [38]:
#Projection with restriccion using loc
Employee.loc[Employee.good_guy=='Yes',{'name','position'}]

                   position      name
0              Protagonist        Neo
1        Underground hacker   Trinity
2                    Leader  Morpheus
5  Guide of the freed minds    Oracle

#### Union example
Using the **concat()** function, you can perform Union in Pandas. 

The **concat()** function allows heavy concatenations along an axis while performing optional set logic like (union or intersection) of the indexes on the other axes.

$pd.concat([<DataFrame_1>,\ldots,<DataFrame_n>], axis=0, join=$'$outer$'$,ignore\_index=False,$$\qquad \qquad keys=None, levels=None, names=None, verify\_integrity=False, copy=True)$

join='outer' is for **union** by default. When it is outer, the function sorts the columns, so you get a warning from Python to indicate this behavior. this is solved adding $sort=False$. In future versions of pandas sort will come with False as default. 

More details about the parameters  can be found at 
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html

Also, a easy way to concatenate is using append() function. 

$<DataFrame\_Result>.append([<DataFrame_1>,\ldots,<DataFrame_n>],ignore\_index=False, sort=None)$

sort needs to be equal to False. 

Note: concat() and append() functions need to be assigned to a new DataFrame object if you want to use the resultant DataFrame.

In [39]:
#load Employee_A data
Employee_A = pd.DataFrame(pd.read_csv('Employee.csv'))
Employee_A

          name                  position good_guy    Salary
0          Neo              Protagonist       Yes  2,000.00
1      Trinity        Underground hacker      Yes  1,700.00
2     Morpheus                    Leader      Yes  1,900.00
3     Sentinel      Robot to kill humans       No  1,100.00
4  Agent Smith          Neo's antagonist       No  1,800.00
5       Oracle  Guide of the freed minds      Yes  1,500.00

In [40]:
Employee_B = pd.DataFrame(pd.read_csv('Employee_B.csv'))
Employee_B

,name,position,good_guy,Department,Salary
0,Luke Skywalker,"Protagonist, son of Darth Vader",Yes,Star Wars,"3,000.00"
1,Princess Leia,Leader in the Rebel Alliance,Yes,Star Wars,"3,700.00"
2,Yoda,Jedi master,Yes,Star Wars,"3,900.00"
3,Han Solo,Robot to kill humans,Yes,Star Wars,"3,100.00"
4,Darth Vader,antagonist,No,Star Wars,"3,800.00"

We use concact() to Union the data, however there is a problem in that the DataFrames have different numbers. In  this case Pandas added NaN to the missing column in EmployeeA.

In [41]:
pd.concat([Employee_A, Employee_B], sort=False)

,name,position,good_guy,Salary,Department
0,Neo,Protagonist,Yes,"2,000.00",NaN
1,Trinity,Underground hacker,Yes,"1,700.00",NaN
2,Morpheus,Leader,Yes,"1,900.00",NaN
3,Sentinel,Robot to kill humans,No,"1,100.00",NaN
4,Agent Smith,Neo's antagonist,No,"1,800.00",NaN
5,Oracle,Guide of the freed minds,Yes,"1,500.00",NaN
0,Luke Skywalker,"Protagonist, son of Darth Vader",Yes,"3,000.00",Star Wars
1,Princess Leia,Leader in the Rebel Alliance,Yes,"3,700.00",Star Wars
2,Yoda,Jedi master,Yes,"3,900.00",Star Wars
3,Han Solo,Robot to kill humans,Yes,"3,100.00",Star Wars
4,Darth Vader,antagonist,No,"3,800.00",Star Wars

In [42]:
# Added the column Department to Employee_A
dpto=['The matrix','The matrix','The matrix','The matrix','The matrix','The matrix']
Employee_A['Department']=dpto
Employee_A

          name                  position good_guy    Salary  Department
0          Neo              Protagonist       Yes  2,000.00  The matrix
1      Trinity        Underground hacker      Yes  1,700.00  The matrix
2     Morpheus                    Leader      Yes  1,900.00  The matrix
3     Sentinel      Robot to kill humans       No  1,100.00  The matrix
4  Agent Smith          Neo's antagonist       No  1,800.00  The matrix
5       Oracle  Guide of the freed minds      Yes  1,500.00  The matrix

In [43]:
pd.concat([Employee_A, Employee_B], sort=False)

,name,position,good_guy,Salary,Department
0,Neo,Protagonist,Yes,"2,000.00",The matrix
1,Trinity,Underground hacker,Yes,"1,700.00",The matrix
2,Morpheus,Leader,Yes,"1,900.00",The matrix
3,Sentinel,Robot to kill humans,No,"1,100.00",The matrix
4,Agent Smith,Neo's antagonist,No,"1,800.00",The matrix
5,Oracle,Guide of the freed minds,Yes,"1,500.00",The matrix
0,Luke Skywalker,"Protagonist, son of Darth Vader",Yes,"3,000.00",Star Wars
1,Princess Leia,Leader in the Rebel Alliance,Yes,"3,700.00",Star Wars
2,Yoda,Jedi master,Yes,"3,900.00",Star Wars
3,Han Solo,Robot to kill humans,Yes,"3,100.00",Star Wars
4,Darth Vader,antagonist,No,"3,800.00",Star Wars

In [44]:
#Using append to concatenate 
Employee_C = pd.DataFrame()#A empty DataFrame 
Employee_C.append([Employee_A,Employee_B], sort=False)

,name,position,good_guy,Salary,Department
0,Neo,Protagonist,Yes,"2,000.00",The matrix
1,Trinity,Underground hacker,Yes,"1,700.00",The matrix
2,Morpheus,Leader,Yes,"1,900.00",The matrix
3,Sentinel,Robot to kill humans,No,"1,100.00",The matrix
4,Agent Smith,Neo's antagonist,No,"1,800.00",The matrix
5,Oracle,Guide of the freed minds,Yes,"1,500.00",The matrix
0,Luke Skywalker,"Protagonist, son of Darth Vader",Yes,"3,000.00",Star Wars
1,Princess Leia,Leader in the Rebel Alliance,Yes,"3,700.00",Star Wars
2,Yoda,Jedi master,Yes,"3,900.00",Star Wars
3,Han Solo,Robot to kill humans,Yes,"3,100.00",Star Wars
4,Darth Vader,antagonist,No,"3,800.00",Star Wars

In [45]:
Employee_A

          name                  position good_guy    Salary  Department
0          Neo              Protagonist       Yes  2,000.00  The matrix
1      Trinity        Underground hacker      Yes  1,700.00  The matrix
2     Morpheus                    Leader      Yes  1,900.00  The matrix
3     Sentinel      Robot to kill humans       No  1,100.00  The matrix
4  Agent Smith          Neo's antagonist       No  1,800.00  The matrix
5       Oracle  Guide of the freed minds      Yes  1,500.00  The matrix

## High-Performance Pandas: eval () and query()

As you know the strengths of NumPy and Pandas lies in the fast operations that they are capable to do, due to the operations are push into C language syntax like vectorizing operation in Numpy and grouping operations in Pandas. This efficient management of the operations reduces computational time and memory use. 

**Evaly()** and **query()** functions allow you direct access to the speed of C without using any cost of allocation of intermediary arrays. 

The next example will show you how is reduced the computational time using Numpy array to perform operations instead of a loop in Python. 

First, we include the NumPy library.

In [46]:
import numpy as np
import pandas as pd

In [47]:
# Creating an two-dimensional array 100000 rows of random numbers by 100 columns 
rows = 100000
cols = 100
df1, df2, df3, df4, df5, df6 = (pd.DataFrame(np.random.rand(rows, cols))for i in range(6))
df1.shape

(100000, 100)

Sum between DataFrames in a traditional way

In [48]:
%timeit df1 + df2+ df3 + df4 + df5 + df6

149 ms ± 32.8 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

Sum between DataFrames using **eval()** method

In [49]:
#Now using eval() function
%timeit pd.eval('df1 + df2 + df3 + df4 + df5 + df6')

50.1 ms ± 3.31 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

it is evident that performing the sum with eval() method the time is reduced for more than 60%.

### Operation supported by eval () method 

The eval() method supports several operations. Some of these operations are listed as follows: 
* Arithmetic operations
* Comparison operators
* Bitwise operators
* Literal 'and' and 'or' in boolean expressions 
* Object attributes and indices

However, eval() method **not** support functions calls, conditional statements, loops, and other more involved constructors. 

#### Examples of the supported operation by eval() method

In the examples both ways (traditional and eval() method) will be presented and the comparison will be carried out with the NumPy  allclose() function, that compare two arrays and return a boolean (True or False) that idicate if two arrays are element-wise equal within a tolerance.

In [50]:
#Arithmetic operations

result =(df3 + df4 + df6) / -df1 * df2   - df5
resultEval = pd.eval('(df3 + df4 + df6) / -df1 * df2   - df5')
print('The Arithmetic operations performed in both ways are equal:',
      np.allclose(result, resultEval))
# Comparison operators
result = (df6 < df5) & (df5 < df4) & (df4 <= df3) & (df3 <= df2) & (df2 != df1) 
resultEval = pd.eval('df6 < df5 < df4 <= df3 <=df2 != df1')
print('The comparison operators performed in both ways are equal:',
      np.allclose(result, resultEval))
# Bitwise operators
result = (df6 < 0.5) & (df5 < 0.3) | (df4 <= df1) & (df2 != df1) 
resultEval = pd.eval('(df6 < 0.5) & (df5 < 0.3) | (df4 <= df1) & (df2 != df1) ')
print('The Bitwise operators performed in both ways are equal:' ,
      np.allclose(result, resultEval))
#Literal 'and' and 'or' in boolean expressions
#Using the previous expresion 
resultEval2 = pd.eval('(df6 < 0.5) and (df5 < 0.3) or (df4 <= df1) and (df2 != df1) ')
print("'and' and 'or' in boolean expressions in both ways are equal:"  ,
      np.allclose(result, resultEval2))
# Object attributes and indices
#Transpose a Dataframe and chose one column 
#to multiplicate with one column from other DataFrame 
result = df5.T[0] + df3.iloc[5]
resultEval2 = pd.eval('df5.T[0] + df3.iloc[5]')
print('Object attributes and indices in both ways are equal: ' ,
      np.allclose(result, resultEval2))

The Arithmetic operations performed in both ways are equal: True
The comparison operators performed in both ways are equal: True
The Bitwise operators performed in both ways are equal: True
'and' and 'or' in boolean expressions in both ways are equal: True
Object attributes and indices in both ways are equal:  True

### Eval operations to labeled columns

You can use eval() method when the columns are labeled. These are some of the operations that you can perform with eval: 
* Compute arithmetic operations with filtering by column name.
* Assigment to any column in a DataFrame.
* Working with Python local variables. In eval method, the character @ is used to identify a variable name.

#### Examples of the supported operation by eval() method over labeled columns

In the examples both ways (traditional and eval() method) will be presented and the comparison will be performed with the NumPy allclose() function.

In [51]:
#Creating a DataFrame with labeled columns
df_1 = pd.DataFrame(np.random.rand(5000, 4), columns=['ColA', 'ColB', 'ColC', 'ColD'])
df_1.head()

       ColA      ColB      ColC      ColD
0  0.993458  0.557831  0.981334  0.213798
1  0.864725  0.586292  0.505157  0.366039
2  0.712452  0.322635  0.735422  0.875522
3  0.561853  0.060063  0.001556  0.358558
4  0.420059  0.388533  0.842406  0.573913

In [52]:
print('Operations over a DataFrame with a labaled columns')
#arithmetic operations with filtering by column name
result = df_1['ColB']-df_1['ColA'] * df_1['ColC']/(df_1['ColD']-1.5)
resultEval = pd.eval("(df_1.ColB-df_1.ColA * df_1.ColC/(df_1.ColD-1.5))")
print('The Arithmetic operations in both ways are equal:',
      np.allclose(result, resultEval))
#This is another way to perform the previous operation 
#without specify the name of the DataFrame, using eval directly from the DataFrame 
resultEval2 = df_1.eval("(ColB-ColA * ColC/(ColD-1.5))")
print('The Arithmetic operations in both ways are equal:',
      np.allclose(result, resultEval2))
#Using a local variable 
ColMean= df_1.mean(1) 
result = df_1.ColD+ ColMean
resultEval = df_1.eval('ColD+ @ColMean')
print('Using a local variable in a calculation in both ways are equal:',
      np.allclose(result, resultEval))
#Assigment to any column in a DataFrame or creating a new one
print('Creating a new labeled column ')
df_1.eval('ColE = ColB - ColA * ColC',inplace=True)
df_1.head()

Operations over a DataFrame with a labaled columns
The Arithmetic operations in both ways are equal: True
The Arithmetic operations in both ways are equal: True
Using a local variable in a calculation in both ways are equal: True
Creating a new labeled column

       ColA      ColB      ColC      ColD      ColE
0  0.993458  0.557831  0.981334  0.213798 -0.417083
1  0.864725  0.586292  0.505157  0.366039  0.149470
2  0.712452  0.322635  0.735422  0.875522 -0.201318
3  0.561853  0.060063  0.001556  0.358558  0.059189
4  0.420059  0.388533  0.842406  0.573913  0.034673

### Operations supported by query() method
Some operations that involve filtering in the columns can not be performed by eval () method. However, Pandas have another method called query(), which is based on evaluated strings as well and ready to perform filtering operations. 

Also, you can use local variables like in eval. 

#### Examples of filtering using query () method 

In the examples both ways (traditional and query() method) will be presented and the comparison will be performed with the NumPy allclose() function.

In [53]:
#To perform the example we use df_1 DataFrame  previously created
df = pd.DataFrame(np.random.rand(1000, 3), columns=['A', 'B', 'C'])
df.head()

          A         B         C
0  0.112757  0.838759  0.689317
1  0.380465  0.027868  0.337713
2  0.041746  0.868757  0.932494
3  0.145743  0.112237  0.967034
4  0.817589  0.633431  0.937575

In [54]:
result1 = df[(df.A < 0.5) & (df.B < 0.5)]
result2 = df.query('A < 0.5 and B < 0.5')
np.allclose(result1, result2)

True

In [55]:
Cmean = df['C'].mean()
result1 = df[(df.A < Cmean) & (df.B < Cmean)]
result2 = df.query('A < @Cmean and B < @Cmean')
np.allclose(result1, result2)

True

# Aggregation in Pandas

Aggregations are  common summary statistics like the mean and standard deviation, which allow you to summarize the “typical” values  in  a  dataset,  but  other  aggregates  are  useful  as  well, such as the  sum,  product,  median, minimum and maximum, quantiles, etc.. When these operations are performed in Series, the aggregates return one value. 

This are the aggregation operations that can be performed in Series and DataFrames.

* count(). Total number of items
* first(). The first item 
* last(). The last item
* mean(). Mean of the items 
* median().The Median of items
* min(). The minimum value of the items
* max(). The maximum value of the items 
* std(). The Standard deviation of the items 
* var(). The variance of the items 
* mad(). The Mean absolute deviation
* prod(). The Product of all items
* sum(). The sum of the items

#### Example of aggregation in a Series

In [56]:
# Create a Series 
#using a normal distribution 
mu, sigma = 5.5, 3.5
#we create random numbers in a range using a normal distribution 
numbers=np.random.normal(mu, sigma, 10)
#Create a Series
s_data = pd.Series(numbers)
print(s_data)
print('Perform some aggregation functions: ')
print('Count() ->', s_data.count())
print('min() ->', s_data.min())
print('max() ->', s_data.max())
print('mean() ->', s_data.mean())
print('std() ->', s_data.std())
print('mad() ->', s_data.mad())
print('prod() ->', s_data.prod())

0     0.431896
1     4.976999
2    11.192187
3     1.018170
4     1.967095
5     5.936225
6     6.865567
7     1.274643
8     4.031365
9     8.417409
dtype: float64
Perform some aggregation functions:
Count() -> 10
min() -> 0.431895570166577
max() -> 11.192186522431342
mean() -> 4.611155632347397
std() -> 3.5528524178538423
mad() -> 2.8665217576370354
prod() -> 84940.1302446703